## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_security_group.cra_upd_docdb_egress_sg will be created
  + resource "aws_security_group" "cra_upd_docdb_egress_sg" {
      + arn                    = (known after apply)
      + description            = "Allow egress to DocumentDB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-docdb-egress-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.cra_upd_docdb_sg will be created
  + resource "aws_security_group" "cra_upd_docdb_sg" {
      + arn                    = (known after apply)
      + description            = "Ingress to DocumentDB Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow ingress to DocumentDB"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "cra-upd-docdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.cra_upd_documentdb.aws_docdb_cluster_parameter_group.this[0] will be created
  + resource "aws_docdb_cluster_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "DB cluster parameter group."
      + family      = "docdb5.0"
      + id          = (known after apply)
      + name        = "parameter-group-upd"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "default_collection_compression"
          + value        = "enabled"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "profiler"
          + value        = "disabled"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "ttl_monitor"
          + value        = "disabled"
        }
    }

  # module.cra_upd_documentdb.aws_docdb_subnet_group.this[0] will be created
  + resource "aws_docdb_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "DB subnet group for the DB Cluster instances."
      + id          = (known after apply)
      + name        = "subnet-group-upd"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + null,
        ]
      + tags        = {
          + "CostCentre" = "cra-upd-dashboard"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + docdb_egress_sg_id = (known after apply)
  + docdb_sg_id        = (known after apply)
16:11:19.393 WARN   Config ../ssm/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
16:11:19.407 WARN   Config ../network/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.

Error: reading SSM Parameter (DOCDB_USERNAME): couldn't find resource

  with data.aws_ssm_parameter.docdb_username,
  on documentdb.tf line 5, in data "aws_ssm_parameter" "docdb_username":
   5: data "aws_ssm_parameter" "docdb_username" {


Error: reading SSM Parameter (DOCDB_PASSWORD): couldn't find resource

  with data.aws_ssm_parameter.docdb_password,
  on documentdb.tf line 9, in data "aws_ssm_parameter" "docdb_password":
   9: data "aws_ssm_parameter" "docdb_password" {

16:11:24.631 ERROR  terraform invocation failed in ./.terragrunt-cache/YhFezZFJv9w1nXuJLzLhAoEPWlI/gyP3_ovh330wzQOVNUOW335QEDo/database
16:11:24.631 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/YhFezZFJv9w1nXuJLzLhAoEPWlI/gyP3_ovh330wzQOVNUOW335QEDo/database
  
  Error: reading SSM Parameter (DOCDB_USERNAME): couldn't find resource
  
    with data.aws_ssm_parameter.docdb_username,
    on documentdb.tf line 5, in data "aws_ssm_parameter" "docdb_username":
     5: data "aws_ssm_parameter" "docdb_username" {
  
  
  Error: reading SSM Parameter (DOCDB_PASSWORD): couldn't find resource
  
    with data.aws_ssm_parameter.docdb_password,
    on documentdb.tf line 9, in data "aws_ssm_parameter" "docdb_password":
     9: data "aws_ssm_parameter" "docdb_password" {
  
  
  exit status 1


```

</details>

